target_channels = {
    'web_development': '@+6D9ITm2YCP82N2E6',
    'сopywriting': '@+qGTqcBaU-6UwOTUy',
    'marketing_smm': '@+dtSczWTS5ag5YmEy',
    'installation_media_content': '@+0nNHNcC6GmoyMGMy',
    'designer': '@+_vdiRVgOTr5jM2Y6',
}

channels_to_read = [
    "https://t.me/onlayn_rabota", "https://t.me/mari_vakansiii", "https://t.me/SeoChat1", "https://t.me/udalenkachatt",
    "https://t.me/ggfreelancechat", "https://t.me/FreelanserSP", "https://t.me/Work_staff_online_free",
    "https://t.me/avitobust", "https://t.me/pomogator", "https://t.me/frilanc_topchat", "https://t.me/freelans007",
    "https://t.me/marketing_digitalz", "https://t.me/ksenka_getcourse_chat", "https://t.me/freelance_dvig",
    "https://t.me/operato1"
]

keyword_groups = {
    'web_development': [
        "веб-дизайн", "front-end разработка", "back-end разработка", "разработка мобильных приложений",
        "CMS (WordPress, Joomla, Drupal)", "Разработка интернет-магазинов", "Верстка сайтов",
        "Адаптивная веб-разработка", "Интеграция API", "Создание анимаций на веб-сайтах",
        "Тестирование и оптимизация сайтов", "Разработка Landing Page", "Создание анимированных онлайн баннеров",
        "Интеграция платежных систем", "Разработка интерактивных элементов на сайте",
        "Разработка административной панели", "Создание адаптивного дизайна для мобильных устройств",
        "Разработка под ключ", "Фронтенд-разработка", "Бэкенд-разработка", "Разработка с использованием фреймворков",
        "Интеграция платформ и CRM-систем"
    ],
    'сopywriting': [
        "написание статей", "копирайтинг для сайтов", "тексты для рекламы", "SEO-тексты", "Рерайтинг",
        "редактирование и коррекция текстов", "Творческое письмо", "Коммерческие предложения", "A/B тест копирайтинга",
        "Корпоративные блоги", "Работа с ключевыми словами", "E-mail маркетинг через тексты", "Письма продаж",
        "Создание текстов для лендингов", "Написание скриптов для видеороликов", "Работа с отзывами и обратной связью",
        "Креативные тексты для социальных сетей", "Подбор ключевых фраз для продвижения",  "SEO-копирайтинг",
        "Создание продающих текстов", "Веб-копирайтинг с учетом юзабилити", "Копирайтинг для email-маркетинга",
        "Креативное копирайтинговое вдохновение"
    ],
    'marketing_smm': [
        "интернет-маркетинг", "продвижение в социальных сетях", "контент-маркетинг", "реклама в интернете",
        "Таргетированная реклама", "Аналитика в интернет-маркетинге", "Real-time маркетинг", "Автоматизация маркетинга",
        "SEO-оптимизация", "Контент-маркетинг", "Рекламные кампании в социальных сетях",  "Контент-стратегия",
        "Рекламная аналитика и оптимизация", "Поисковая маркетинговая стратегия (SEM)", "email-маркетинг",
        "Управление репутацией бренда (ORM)", "Автоматизация маркетинга с использованием CRM",
    ],
    'installation_media_content': [
        "видеомонтаж", "аудиомонтаж", "обработка фото", "создание анимации", "спецэффекты",  "Развёртка и трекинг",
        "Цветокоррекция", "Стабилизация видео", "Озвучка видео", "Motion graphics", "VR/AR монтаж", "Гифки",
        "Музыкальное оформление видео", "Монтаж видеороликов с использованием сценария", "Создание слайд-шоу",
        "Разработка коротких видеороликов для рекламных кампаний", "Цветокоррекция и цветовая градация",
        "Композитинг и визуальные эффекты", "Озвучивание и звуковое сопровождение", "360-градусный монтаж",
        "Создание VR-видео и интерактивных видеопроектов", "Видеозаставки и заставки для видео",
        "Подготовка видеоматериалов для мобильных устройств и стриминговых платформ"
    ],
    'designer': [
        "графический дизайн", "дизайн веб-сайтов", "логотипы", "иллюстрации", "анимация", "UI/UX дизайн",
        "темы Дизайн", "Брендинг", "Упаковка", "Инфографика", "Печатная продукция", "Дизайн афиш", "Типографика",
        "Дизайн фирменного стиля", "Дизайн упаковки продуктов", "Дизайн брошюр и каталогов", "UX/UI дизайн",
        "Дизайн мобильных приложений", "Дизайн презентаций", "Дизайн баннеров", "Дизайн иллюстраций по заказу",
        "Дизайн инфографики для социальных сетей", "Графический дизайн интерфейсов",
        "Дизайн информационных графиков", "Дизайн анимации"
    ]
}
